CREATE TABLE [Справочник_групп_основных_фондов_по_классификации] (
	[Код_группы] int IDENTITY(1,1) NOT NULL,
	[Наименование] nvarchar(50) NOT NULL,
	PRIMARY KEY ([Код_группы])
);
CREATE TABLE [Справочник_ответственных_лиц] (
	[Код_ответственного_лица] int IDENTITY(1,1) NOT NULL,
	[Фамилия_И.О.] nvarchar(50) NOT NULL,
	PRIMARY KEY ([Код_ответственного_лица])
);
CREATE TABLE [Акт_ввода_основных_средств_в_эксплуатацию] (
	[Инвентарный_номер] int IDENTITY(1,1) NOT NULL,
	[Название] nvarchar(50) NOT NULL,
	[Код_группы] int NOT NULL,
	[Код_ответственного_лица] int NOT NULL,
	[Краткая_характеристика] nvarchar(100),
	[Балансовая_стоимость] decimal(18,0) NOT NULL,
	[Дата_ввода] date NOT NULL,
	[Номер_акта] int NOT NULL,
	PRIMARY KEY ([Инвентарный_номер])
);
CREATE TABLE [Протокол_расхода_основных_средств] (
	[Код_протокола] int IDENTITY(1,1) NOT NULL,
	[Инвентарный_номер] int NOT NULL UNIQUE,
	[Причина_выбытия] nvarchar(150) NOT NULL,
	[Документы_и_их_номера] nvarchar(150) NOT NULL,
	[Дата_выбытия] date NOT NULL,
	[Номер_протокола] int NOT NULL,
	PRIMARY KEY ([Код_протокола])
);
ALTER TABLE [Акт_ввода_основных_средств_в_эксплуатацию] ADD CONSTRAINT [Акт_ввода_основных_средств_в_эксплуатацию_fk2] FOREIGN KEY ([Код_группы]) REFERENCES [Справочник_групп_основных_фондов_по_классификации]([Код_группы]);
ALTER TABLE [Акт_ввода_основных_средств_в_эксплуатацию] ADD CONSTRAINT [Акт_ввода_основных_средств_в_эксплуатацию_fk3] FOREIGN KEY ([Код_ответственного_лица]) REFERENCES [Справочник_ответственных_лиц]([Код_ответственного_лица]);
ALTER TABLE [Протокол_расхода_основных_средств] ADD CONSTRAINT [Протокол_расхода_основных_средств_fk1] FOREIGN KEY ([Инвентарный_номер]) REFERENCES [Акт_ввода_основных_средств_в_эксплуатацию]([Инвентарный_номер]);